// - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
//     Перевірте  скрипт при a, що дорівнює 1, 0, -3

   /*let x = prompt('Яке значення x?','');
    if (x != 0){
        alert('Вірно');
    }else {
        alert('Невірно');
}*/

/*---------------------------------------------------------------------------------------*/

// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить,
// до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

/*let time = prompt('Вкажіть число від 0 до 59', '');
if (time >= 0 && time <= 14) {
    alert('1 четверть');
} else if (time >= 15 && time <= 29) {
    alert('2 четверть');
} else if (time >= 30 && time <= 44) {
    alert('3 четверть');
} else if (time >= 45 && time <= 59) {
    alert('4 четверть');
}else {
    alert('Невірно вказане значення');
}*/

/*---------------------------------------------------------------------------------------*/

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду)
// місяця потрапляє це число (у першу, другу чи третю).


/*let day = prompt ('Вкажіть день місяця від 1 до 31', '');
if(day >= 1 && day <= 10){
    alert('1 декада');
}else if (day >= 11 && day <= 20){
    alert('2 декада');
}
else if (day >= 21 && day <= 31){
    alert('3 декада');
}else {
    alert('Невірно вказане значення');
}*/

/*---------------------------------------------------------------------------------------*/

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий
// номер дня тижня і на екрані відображається інфа що заплановано на цей день
// (можна замість плану на день, назву дня англійською).

/*let dayOfWeek = prompt('Вкажіть день тижня від 1 до 7', '')
switch (dayOfWeek){
    case  dayOfWeek = '1':
        alert('Monday');
        break
    case  dayOfWeek = '2':
        alert('Tuesday');
        break
    case  dayOfWeek = '3':
        alert('Wednesday');
        break
    case  dayOfWeek = '4':
        alert('Thursday');
        break
    case  dayOfWeek = '5':
        alert('Friday');
        break
    case  dayOfWeek = '6':
        alert('Saturday');
        break
    case  dayOfWeek = '7':
        alert('Sunday');
        break
    default:
        alert('Wrong value');
}*/

/*---------------------------------------------------------------------------------------*/

// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.


/*let a = Number (prompt('Enter 1 number'));
let b = Number (prompt('Enter 2 number'));
if (a > b){
    alert(a);
}else if (b > a){
    alert(b);
}else if (b == a){
    alert(a);
}else {
    alert('Enter only number!!!');
}*/

/*---------------------------------------------------------------------------------------*/

// - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно).
// Напишіть код який, за допомоги  оператора || буде присвоювати змінній х значення "default"
// якщо значення змінної х являється falsy (хибноподібне, тобто кастується до false)


let x = prompt() || 'default';
    console.log(x);
    console.log(typeof x);






